Repository: luca-hom/bmi
Catalog: lib/l10n/app_*.arb
Languages: de

# baseAppBarWelcomePage
source: Welcome Page
de: Willkommensseite

# baseAppBarBMICalculator
source: BMI Calculator
de: BMI-Rechner

# baseAppBarBMIResult
source: BMI Result
de: BMI-Ergebnis

# baseAppBarBMIHistoryDotMenu
source: BMI History
de: BMI-Verlauf

# baseAppBarBMIHistory
source: BMI History of {NAME}
de: {NAME}'s BMI-Verlauf

# baseAppBarSettings
source: Settings
de: Einstellungen

# baseAppBarSettingsUser
source: User Settings
de: Benutzereinstellungen

# baseAppBarBMIRatingLegend
source: All BMI Ratings
de: Alle BMI-Bewertungen

# bmi0Title
source: Very severly underweight
de: Sehr starkes Untergewicht

# bmi0Description
source: BMI Value below 15.0
de: BMI-Wert unter 15,0

# bmi1Title
source: Severly underweight
de: Stark untergewichtig

# bmi1Description
source: BMI Value between 15.0 and 16.0
de: BMI-Wert zwischen 15,0 und 16,0

# bmi2Title
source: Moderately underweight
de: Mäßig untergewichtig

# bmi2Description
source: BMI Value between 16.0 and 17.0
de: BMI-Wert zwischen 16,0 und 17,0

# bmi3Title
source: Slightly underweight
de: Gering untergewichtig

# bmi3Description
source: BMI Value between 17.0 and 18.5
de: BMI-Wert zwischen 17,0 und 18,5

# bmi4Description
source: BMI Value between 18.5 and 25.0
de: BMI-Wert zwischen 18,5 und 25,0

# bmi5Title
source: Overweight
de: Übergewichtig

# bmi5Description
source: BMI Value between 25.0 and 30.0
de: BMI-Wert zwischen 25,0 und 30,0

# bmi6Title
source: Moderately obese
de: Mäßig fettleibig

# bmi6Description
source: BMI Value between 30.0 and 35.0
de: BMI-Wert zwischen 30,0 und 35,0

# bmi7Title
source: Severly overweight
de: Starkes Übergewicht

# bmi7Description
source: BMI Value between 35.0 and 40.0
de: BMI-Wert zwischen 35,0 und 40,0

# bmi8Title
source: Very severly overweight
de: Sehr stark übergewichtig

# bmi8Description
source: BMI Value over 40.0
de: BMI-Wert über 40,0

# welcomePageBtn
source: Open BMI Calculator
de: BMI-Rechner öffnen

# welcomePageText
source: Body mass index (BMI) is a value derived from the mass (weight) and height of a person. The BMI is defined as the body mass divided by the square of the body height, and is expressed in units of kg/m2, resulting from mass in kilograms and height in metres.
de: Der Body-Mass-Index (BMI) ist ein Wert, der sich aus der Masse (Gewicht) und der Größe einer Person ergibt. Der BMI ist definiert als die Körpermasse geteilt durch das Quadrat der Körpergröße und wird in der Einheit kg/m2 ausgedrückt, die sich aus der Masse in Kilogramm und der Größe in Metern ergibt.

# bmiCalculatorInputWeight
source: Enter Weight (kg)
de: Gewicht eingeben (kg)

# bmiCalculatorInputHeight
source: Enter Height (cm)
de: Höhe eingeben (cm)

# bmiCalculatorBtnClear
source: Clear Input
de: Eingabe löschen

# bmiCalculatorBtnCalculateBMI
source: Calculate BMI
de: BMI berechnen

# bmiResultTextWeight
source: Weight (kg)
de: Gewicht (kg)

# bmiResultTextHeight
source: Height (cm)
de: Größe (cm)

# bmiResultTextResult
source: BMI Result
de: BMI-Ergebnis

# bmiResultTextRating
source: BMI Rating
de: BMI Bewertung

# bmiResultTextUser
source: Active User
de: Aktiver Benutzer

# bmiResultBtnSaveBMI
source: Save my BMI Data
de: Ergebnis speichern

# bmiResultBtnDetails
source: Show BMI Details
de: BMI-Details anzeigen

# bmiResultToastSaveBMI
source: Saved to your History
de: In Ihrer Historie gespeichert

# bmiHistoryBtnDeleteHistory
source: Delete your History
de: BMI-Verlauf löschen

# bmiHistoryToastDeleteHistory
source: Deleted your BMI History!
de: BMI-Verlauf gelöscht

# settingsBtnConfigUnits
source: Configure Units
de: Einheiten konfigurieren

# settingsBtnConfigUsers
source: Configure Users
de: Benutzer konfigurieren

# settingsUserBtnAddUser
source: Add User
de: Benutzer hinzufügen

# settingsUserTextActiveUser
source: Active User:
de: Aktiver Benutzer:

# settingsUserTextInputName
source: Enter a name
de: Geben Sie einen Namen ein

# settingsUserBtnCancel
source: Cancel
de: Abbrechen
